#include <iostream>
using namespace std;
/*
    «адача 1.
    –азработать класс Person, который содержит скрытые пол€ дл€ хранени€: 
        имени, 
        возраста, 
        пола и 
        телефонного номера. 
    Ќапишите методы, которые смогут измен€ть эти пол€ данных индивидуально. 
    Ќапишите метод дл€ выводе отформатированных данных о человеке.  
*/

/*
    «адача 2.
    –азработать класс —обака, который содержит скрытые пол€ дл€ хранени€: 
        кличка
        возраст
        пола 
        породы 
    Ќапишите методы, которые смогут измен€ть эти пол€ данных индивидуально. 
    Ќапишите метод дл€ выводе отформатированных данных о животном.  
*/

/*
    «адача 3. (дополнительно)
    –азработать класс “очка, который содержит скрытые пол€ дл€ хранени€: 
        x
        y
    Ќапишите методы, которые смогут измен€ть эти пол€ данных индивидуально. 
    Ќапишите метод предназначенный дл€ вычислени€ рассто€ни€ до другой точке
*/
int main()
{

    return 0;
}