Задание 1.
	Написать программу для вывода таблицы умножения 10х10 в консоль.
	Использовать цикл for

Задание 2.
	Напишите оператор for, while и do..while для посчета суммы числе от 1 до 100 с шагом 3

Задание 3.
	Найдите и исправте ошибки в следующем фрагменте кода:

	record = 0;
	while(record < 100)
	{
		printf("\nRecord %d , record)
	}

Задание 4 (Дополнительное).
	Написать программу, которая выводит на экран - следующую фигуру:

*********************
*                   *
*                   *
*                   *
*                   *
*                   *
*                   *
*********************

	ширина и высота фигуры задаются пользователем с клавиатуры
