/*
    Домашнее задание
    
    Курс:   Introduction
    Занятие #10
    Тема:   Адресная арифметика, Динамическое выделение памяти, 
            указатели на функции, сортировка пузырьком    
*/
#include <stdio.h>
#include <stdlib.h>

/*
    Задание 1.
    Запросить у пользователья через scanf размер массива.
    Создать целочисленный массив указанного размера (используя функцию malloc).
    Заполнить массив данными пользователя (через scanf)
    Вывести полученный массив на экран

    Примечание: не забывайте очистить память выделенную для массива
*/
void task01()
{
    // Ваше решение
}

/*
    Задание 2.
    Создать массив размером 20 элементов.
    Заполнить массив случайными числами в диапазоне от 1 до 100.
    Отсортировать массив в порядке возрастания
*/
void task02()
{
    // Ваше решение
}

/*
    Задание 3.
    Создать массив размером 10 элементов.
    Заполнить массив случайными числами в диапазоне от 1 до 10.
    Найти повторяющиеся элементы и вывести на экран только те
    элементы, которые повторяются более двух раз, например для массива
    
    [1, 2, 1, 5, 6, 1, 2, 7, 8, 9, 4]

    Результат должен быть таким:

    1: 3
    2: 2

    т.к. единица повторяется три раза, двойка - два
*/
void task03()
{
    // Ваше решение
}

int main()
{
    task01();
    task02();
    task03();

    system("pause");
    return 0;
}