/* 
    Домашнее задание №1

    Написать программу, которая выводит в консоль следующий текст

	"To be or not to be"
	        \Shakespeare\
*/

#include <stdio.h>
#include <stdlib.h>

void main()
{
    printf("\"To be or not to be\"\n\t\\Shakespeare\\\n");
    system("pause");
}