// HomeWork15.cpp: определяет точку входа для консольного приложения.
//

#include "stdafx.h"

/*
    Задание 1. Создать базовый класс «Домашнее животное» и 
    производные классы «Собака», «Кошка», «Попугай». 
    С помощью конструктора установить имя каждого животного и 
    его характеристики.
*/

/*
    Задание 2.
    Создать базовый класс с виртуальной функцией - 
    корни уравнения. Создать производные классы: класс линейных 
    уравнений и класс квадратных уравнений. Определить функцию 
    вычисления корней уравнений.
*/

/*
    Задание 3.
    Создайте базовый класс Shape для рисования плоских фигур. 
    Определите виртуальные методы:
        Show() - вывод на экран информации о фигуре,
       
    Определите производные классы: 
        Square    - квадрат, который характеризуется координатами 
                    левого верхнего угла и длиной стороны
        Rectangle - прямоугольник с заданными координатами верхнего 
                    левого угла и размерами
        Circle    - окружность с заданными координатами центра и 
                    радиусом
        Ellipse   - эллипс с заданными координатами верхнего угла 
                    описанного вокруг него прямоугольника со 
                    сторонами, параллельными осям координат, и 
                    размерами этого прямоугольника.
*/

/*
    Задание 4 (Дополнительное)
    Создать класс "Студент", который определяется полями: 
        ФИО, 
        номер группы, 
        название курса, 
        средний балл успеваемости. 
    Пусть имеется массив объектов этого класса. 
    Создать метод сортировки по различным критериям 
    (по фамилии, по среднему баллу, успеваемости). 
    Метод сравнения двух объектов передать в метод сортировки 
    как указатель на функцию сортировки.
*/
int _tmain(int argc, _TCHAR* argv[])
{
	return 0;
}

